/* 
Home_154.
    Даны два неупорядоченных массива, но элементы связанны индексами.
    В первом массиве указаны фамилии и инициалы,
    во втором массиве стоят оценки по информатике каждого ученика.
    Вывести оценочную ведомость учеников:
        а). упорядоченного по фамилии;
        б). упорядоченного по оценкам.
*/

/*
От себя:
    Оба масстива имеют одинаковый размер (допустим 20).
    Первый фиксированный. Сожержит индекс и Ф.И.О.
    Второй генерируемый. Содержит индекс и оченку [1-5]
*/